h-5-0deg/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];
internalField   uniform 0;

boundaryField
{
    inlet
    {
        type zeroGradient;
    }

    outlet
    {
        type totalPressure;
        value uniform 0;
	gamma 1.4;
	p0 uniform 0;
    }

    ground
    {
        type zeroGradient;
    }

    sky
    {
        type zeroGradient;
    }

    side_d
    {
        type symmetryPlane;
    }

    side_e
    {
        type symmetryPlane;
    }

    body
    {
        type zeroGradient;
    }
    
    neighborhood
    {
        type zeroGradient;
    }
}

// ************************************************************************* //
